Server/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "android task"], ["created_at", "2015-12-16 04:41:40.922220"], ["updated_at", "2015-12-16 04:41:40.922220"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save