Server/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."assignee_id" = ?  [["assignee_id", 1]]
---
  def getAllTasks
    userID= User.find(params[:id])
    tasks= Task.where(:assignee_id => userID.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def getTimeline
    user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def getFriends
    userID = User.find(params[:id])